; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 10157)
	(= (fuel plane1) 1929)
	(= (slow-burn plane1) 4)
	(= (fast-burn plane1) 14)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city0)
	(= (capacity plane2) 5098)
	(= (fuel plane2) 1643)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 5)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 1)
	(at plane3 city0)
	(= (capacity plane3) 8673)
	(= (fuel plane3) 2164)
	(= (slow-burn plane3) 4)
	(= (fast-burn plane3) 15)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city0)
	(= (capacity plane4) 10466)
	(= (fuel plane4) 3865)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 13)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 6)
	(at plane5 city2)
	(= (capacity plane5) 5485)
	(= (fuel plane5) 426)
	(= (slow-burn plane5) 2)
	(= (fast-burn plane5) 4)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 6)
	(at person1 city1)
	(at person2 city2)
	(at person3 city0)
	(at person4 city1)
	(at person5 city1)
	(at person6 city1)
	(at person7 city0)
	(at person8 city2)
	(at person9 city2)
	(at person10 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 649)
	(= (distance city0 city2) 699)
	(= (distance city1 city0) 649)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 775)
	(= (distance city2 city0) 699)
	(= (distance city2 city1) 775)
	(= (distance city2 city2) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane5 city2)
	(at person1 city2)
	(at person2 city1)
	(at person3 city2)
	(at person4 city0)
	(at person5 city0)
	(at person6 city2)
	(at person7 city1)
	(at person8 city2)
	(at person9 city1)
	(at person10 city1)
	))

(:metric minimize (+ (* 1 (total-time))  (* 1 (total-fuel-used))))
)

; plan
1. (fly plane2 city0 city2)
   deleted: (at plane2 city0)
   added: (at plane2 city2)
   changed: (total-fuel-used) from 0 to 1398, (fuel plane2) from 1643 to 245
   goals met: 2 of 11
2. (board person7 plane4 city0)
   deleted: (at person7 city0)
   added: (in person7 plane4)
   changed: (onboard plane4) from 0 to 1
   goals met: 2 of 11
3. (board person10 plane4 city0)
   deleted: (at person10 city0)
   added: (in person10 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 2 of 11
4. (board person3 plane4 city0)
   deleted: (at person3 city0)
   added: (in person3 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 2 of 11
5. (fly plane4 city0 city1)
   deleted: (at plane4 city0)
   added: (at plane4 city1)
   changed: (total-fuel-used) from 1398 to 3994, (fuel plane4) from 3865 to 1269
   goals met: 2 of 11
6. (debark person7 plane4 city1)
   deleted: (in person7 plane4)
   added: (at person7 city1)
   changed: (onboard plane4) from 3 to 2
   goals met: 3 of 11
7. (debark person10 plane4 city1)
   deleted: (in person10 plane4)
   added: (at person10 city1)
   changed: (onboard plane4) from 2 to 1
   goals met: 4 of 11
8. (board person1 plane4 city1)
   deleted: (at person1 city1)
   added: (in person1 plane4)
   changed: (onboard plane4) from 1 to 2
   goals met: 4 of 11
9. (board person2 plane1 city2)
   deleted: (at person2 city2)
   added: (in person2 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 11
10. (board person4 plane4 city1)
   deleted: (at person4 city1)
   added: (in person4 plane4)
   changed: (onboard plane4) from 2 to 3
   goals met: 4 of 11
11. (board person5 plane4 city1)
   deleted: (at person5 city1)
   added: (in person5 plane4)
   changed: (onboard plane4) from 3 to 4
   goals met: 4 of 11
12. (board person6 plane4 city1)
   deleted: (at person6 city1)
   added: (in person6 plane4)
   changed: (onboard plane4) from 4 to 5
   goals met: 4 of 11
13. (board person9 plane1 city2)
   deleted: (at person9 city2)
   added: (in person9 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 11
14. (refuel plane1 city2)
   changed: (fuel plane1) from 1929 to 10157
   goals met: 4 of 11
15. (refuel plane4 city1)
   changed: (fuel plane4) from 1269 to 10466
   goals met: 4 of 11
16. (fly plane4 city1 city2)
   deleted: (at plane4 city1)
   added: (at plane4 city2)
   changed: (total-fuel-used) from 3994 to 7094, (fuel plane4) from 10466 to 7366
   goals met: 4 of 11
17. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   changed: (onboard plane4) from 5 to 4
   goals met: 5 of 11
18. (debark person3 plane4 city2)
   deleted: (in person3 plane4)
   added: (at person3 city2)
   changed: (onboard plane4) from 4 to 3
   goals met: 6 of 11
19. (debark person6 plane4 city2)
   deleted: (in person6 plane4)
   added: (at person6 city2)
   changed: (onboard plane4) from 3 to 2
   goals met: 7 of 11
20. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 7094 to 10194, (fuel plane1) from 10157 to 7057
   goals met: 7 of 11
21. (debark person2 plane1 city1)
   deleted: (in person2 plane1)
   added: (at person2 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 8 of 11
22. (debark person9 plane1 city1)
   deleted: (in person9 plane1)
   added: (at person9 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 9 of 11
23. (fly plane4 city2 city0)
   deleted: (at plane4 city2)
   added: (at plane4 city0)
   changed: (total-fuel-used) from 10194 to 12990, (fuel plane4) from 7366 to 4570
   goals met: 9 of 11
24. (debark person4 plane4 city0)
   deleted: (in person4 plane4)
   added: (at person4 city0)
   changed: (onboard plane4) from 2 to 1
   goals met: 10 of 11
25. (debark person5 plane4 city0)
   deleted: (in person5 plane4)
   added: (at person5 city0)
   changed: (onboard plane4) from 1 to 0
   goals met: 11 of 11
